#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ecs_service.data.aws_caller_identity.current[0]: Reading...
module.alb.data.aws_partition.current: Reading...
data.aws_availability_zones.available: Reading...
module.ecs_service.module.container_definition["ecs-sample"].data.aws_region.current: Reading...
module.ecs_service.data.aws_partition.current[0]: Reading...
data.aws_ssm_parameter.ecs_optimized_ami: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs_service.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.module.container_definition["ecs-sample"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_region.current[0]: Reading...
module.autoscaling["ex_2"].data.aws_partition.current: Reading...
module.ecs_service.data.aws_iam_policy_document.infrastructure_iam_role[0]: Reading...
module.autoscaling["ex_1"].data.aws_partition.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs_service.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.autoscaling["ex_2"].data.aws_partition.current: Read complete after 0s [id=aws]
module.autoscaling["ex_1"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1734719305]
module.ecs_service.data.aws_iam_policy_document.infrastructure_iam_role[0]: Read complete after 0s [id=2997972191]
module.autoscaling["ex_2"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.autoscaling["ex_1"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.autoscaling["ex_1"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
module.autoscaling["ex_2"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
module.ecs_service.data.aws_caller_identity.current[0]: Read complete after 0s [id=576640153544]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=2029318031]
data.aws_ssm_parameter.ecs_optimized_ami: Read complete after 0s [id=/aws/service/ecs/optimized-ami/amazon-linux-2023/recommended]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ex-tf-ecs"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["ex_http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.this["ex_ecs"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "5"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for ex-tf-ecs application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-ecs-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Example"               = "ex-tf-ecs"
          + "Name"                  = "ex-tf-ecs"
          + "Repository"            = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 80
    }

  # module.autoscaling["ex_1"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "ex-tf-ecs-ex_1-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Example"
          + propagate_at_launch = true
          + value               = "ex-tf-ecs"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ex-tf-ecs-ex_1"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.autoscaling["ex_1"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ex-tf-ecs-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all    = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling["ex_1"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for ex-tf-ecs"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-ecs-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.autoscaling["ex_1"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.autoscaling["ex_1"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.autoscaling["ex_1"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-ecs-ex_1-"
      + region                 = "us-east-1"
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9ZXgtdGYtZWNzCkVDU19MT0dMRVZFTD1kZWJ1ZwpFQ1NfQ09OVEFJTkVSX0lOU1RBTkNFX1RBR1M9eyJFeGFtcGxlIjoiZXgtdGYtZWNzIiwiTmFtZSI6ImV4LXRmLWVjcyIsIlJlcG9zaXRvcnkiOiJodHRwczovL2dpdGh1Yi5jb20vdGVycmFmb3JtLWF3cy1tb2R1bGVzL3RlcnJhZm9ybS1hd3MtZWNzIn0KRUNTX0VOQUJMRV9UQVNLX0lBTV9ST0xFPXRydWUKRU9GCg=="
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling["ex_2"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 5
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "ex-tf-ecs-ex_2-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "price-capacity-optimized"
              + spot_instance_pools                      = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override {
                  + instance_type     = "m4.large"
                  + weighted_capacity = "2"
                }
              + override {
                  + instance_type     = "t3.large"
                  + weighted_capacity = "1"
                }
            }
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Example"
          + propagate_at_launch = true
          + value               = "ex-tf-ecs"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ex-tf-ecs-ex_2"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.autoscaling["ex_2"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ex-tf-ecs-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all    = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling["ex_2"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for ex-tf-ecs"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-ecs-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.autoscaling["ex_2"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.autoscaling["ex_2"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.autoscaling["ex_2"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-ecs-ex_2-"
      + region                 = "us-east-1"
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9ZXgtdGYtZWNzCkVDU19MT0dMRVZFTD1kZWJ1ZwpFQ1NfQ09OVEFJTkVSX0lOU1RBTkNFX1RBR1M9eyJFeGFtcGxlIjoiZXgtdGYtZWNzIiwiTmFtZSI6ImV4LXRmLWVjcyIsIlJlcG9zaXRvcnkiOiJodHRwczovL2dpdGh1Yi5jb20vdGVycmFmb3JtLWF3cy1tb2R1bGVzL3RlcnJhZm9ybS1hd3MtZWNzIn0KRUNTX0VOQUJMRV9UQVNLX0lBTV9ST0xFPXRydWUKRUNTX0VOQUJMRV9TUE9UX0lOU1RBTkNFX0RSQUlOSU5HPXRydWUKRU9GCg=="
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-ecs-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.autoscaling_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.ecs_service.data.aws_subnet.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "us-east-1"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "us-east-1"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + region             = "us-east-1"
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "ex-tf-ecs"
      + platform_version                   = (known after apply)
      + region                             = "us-east-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "ex_1"
          + weight            = 1
        }

      + load_balancer {
          + container_name   = "ecs-sample"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + volume_configuration {
          + name = "ebs-volume"

          + managed_ebs_volume {
              + encrypted        = true
              + file_system_type = "xfs"
              + role_arn         = (known after apply)
              + size_in_gb       = 5
              + volume_type      = "gp3"
            }
        }
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image                  = "nginx"
                  + interactive            = false
                  + linuxParameters        = {
                      + initProcessEnabled = false
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/ex-tf-ecs/ecs-sample"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints            = [
                      + {
                          + containerPath = "/var/www/my-vol"
                          + sourceVolume  = "my-vol"
                        },
                      + {
                          + containerPath = "/ebs/data"
                          + sourceVolume  = "ebs-volume"
                        },
                    ]
                  + name                   = "ecs-sample"
                  + portMappings           = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + name          = "ecs-sample"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + restartPolicy          = {
                      + enabled = true
                    }
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + versionConsistency     = "disabled"
                },
            ]
        )
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "ex-tf-ecs"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + region                   = "us-east-1"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                 = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = true

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "my-vol"
        }
      + volume {
          + configure_at_launch = true
          + name                = "ebs-volume"
        }
    }

  # module.ecs_service.aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Task execution role IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ex-tf-ecs-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_service.aws_iam_role.infrastructure_iam_role[0] will be created
  + resource "aws_iam_role" "infrastructure_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs.amazonaws.com"
                        }
                      + Sid       = "ECSServiceAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Amazon ECS infrastructure IAM role that is used to manage your infrastructure"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-ecs-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_service.aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for ex-tf-ecs"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-ecs-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_service.aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:us-east-1:576640153544:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "576640153544"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ex-tf-ecs-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.infrastructure_iam_role_ebs_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "infrastructure_iam_role_ebs_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSInfrastructureRolePolicyForVolumes"
      + role       = (known after apply)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.ecs_service.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ex-tf-ecs-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs_service.aws_vpc_security_group_ingress_rule.this["alb_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                          = (known after apply)
      + description                  = "Service port"
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs-alb_http"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs-alb_http"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + to_port                      = 80
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + route                  = (known after apply)
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all             = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all         = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                                       = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all                             = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_cluster.module.cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ex-tf-ecs"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "/aws/ecs/ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "/aws/ecs/ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

  # module.ecs_cluster.module.cluster.aws_ecs_capacity_provider.this["ex_1"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ex_1"
      + region   = "us-east-1"
      + tags     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = "ENABLED"
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 5
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 60
            }
        }
    }

  # module.ecs_cluster.module.cluster.aws_ecs_capacity_provider.this["ex_2"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ex_2"
      + region   = "us-east-1"
      + tags     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = "ENABLED"
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 15
              + minimum_scaling_step_size = 5
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # module.ecs_cluster.module.cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ex-tf-ecs"
      + region   = "us-east-1"
      + tags     = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_log_group_name = "/aws/ecs/ex-tf-ecs"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.module.cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "ex_1",
          + "ex_2",
        ]
      + cluster_name       = "ex-tf-ecs"
      + id                 = (known after apply)
      + region             = "us-east-1"

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "ex_2"
          + weight            = 40
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "ex_1"
          + weight            = 60
        }
    }

  # module.ecs_service.module.container_definition["ecs-sample"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ex-tf-ecs/ecs-sample"
      + name_prefix       = (known after apply)
      + region            = "us-east-1"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
      + tags_all          = {
          + "Example"    = "ex-tf-ecs"
          + "Name"       = "ex-tf-ecs"
          + "Repository" = "https://github.com/terraform-aws-modules/terraform-aws-ecs"
        }
    }

Plan: 63 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @JustCloudOps, Action: `pull_request`*